src/Catalogs/ИнформационныеБазыПорта/ИнформационныеБазыПорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазыПорта</name>
  <predefined>
    <items>
      <name>EDS</name>
      <description>EDS</description>
    </items>
    <items>
      <name>УПП</name>
      <description>УПП</description>
    </items>
    <items>
      <name>УКТ</name>
      <description>УКТ</description>
    </items>
    <items>
      <name>ВМКТ</name>
      <description>ВМКТ</description>
    </items>
    <items>
      <name>Скаут</name>
      <description>Скаут</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗапроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗапросаКарточки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ИнформационныеБазыПорта/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает параметры подключения к внешней системе.
//
// Параметры:
//  База - СправочникСсылка.ИнформационныеБазыПорта - предопределённый элемент справочника.
//
// Возвращаемое значение:
//  Структура:
//   * АдресWSDL - Строка -
//   * ПользовательСервиса - Строка -
//   * ПарольСервиса - Строка -
//   * URIПространстваИмен - Строка -
//   * ИмяСервиса - Строка -
//   * ИмяТочкиПодключения - Строка -
//   * КодПроверки - Строка -
//   * Путь - Строка -
//   * Порт - Число -
//   * ТаймаутЗапроса - Число -
//   * ТаймаутЗапросаКарточки - Число -
//   * ИдентификаторКлиента - Строка -
Функция ПараметрыПодключения(База) Экспорт

	Параметры = НовыеПараметрыПодключения();
	Если Не ЗначениеЗаполнено(База) Тогда
		ВызватьИсключение "Не указана информационная база порта.";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИнформационныеБазыПорта.АдресWSDL КАК АдресWSDL,
		|	ИнформационныеБазыПорта.ПользовательСервиса КАК ПользовательСервиса,
		|	ИнформационныеБазыПорта.ПарольСервиса КАК ПарольСервиса,
		|	ИнформационныеБазыПорта.URIПространстваИмен КАК URIПространстваИмен,
		|	ИнформационныеБазыПорта.ИмяСервиса КАК ИмяСервиса,
		|	ИнформационныеБазыПорта.ИмяТочкиПодключения КАК ИмяТочкиПодключения,
		|	ИнформационныеБазыПорта.КодПроверки КАК КодПроверки,
		|	ИнформационныеБазыПорта.Путь КАК Путь,
		|	ИнформационныеБазыПорта.Порт КАК Порт,
		|	ИнформационныеБазыПорта.ТаймаутЗапроса КАК ТаймаутЗапроса,
		|	ИнформационныеБазыПорта.ТаймаутЗапросаКарточки КАК ТаймаутЗапросаКарточки,
		|	ИнформационныеБазыПорта.ИдентификаторКлиента КАК ИдентификаторКлиента
		|ИЗ
		|	Справочник.ИнформационныеБазыПорта КАК ИнформационныеБазыПорта
		|ГДЕ
		|	ИнформационныеБазыПорта.Ссылка = &База";
	Запрос.УстановитьПараметр("База", База);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение СтрШаблон(
			"Не найден элемент справочника ""Информационные базы порта"": %1.",
			База);
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Параметры, Выборка);

	Возврат Параметры;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеПараметрыПодключения()

	Параметры = Новый Структура;
	Параметры.Вставить("АдресWSDL", "");
	Параметры.Вставить("ПользовательСервиса", "");
	Параметры.Вставить("ПарольСервиса", "");
	Параметры.Вставить("URIПространстваИмен", "");
	Параметры.Вставить("ИмяСервиса", "");
	Параметры.Вставить("ИмяТочкиПодключения", "");
	Параметры.Вставить("КодПроверки", "");
	Параметры.Вставить("Путь", "");
	Параметры.Вставить("Порт", 0);
	Параметры.Вставить("ТаймаутЗапроса", 0);
	Параметры.Вставить("ТаймаутЗапросаКарточки", 0);
	Параметры.Вставить("ИдентификаторКлиента", "");

	Возврат Параметры;

КонецФункции

#КонецОбласти

#КонецЕсли
